Мюнцкабинент_30/src/Documents/ПоступлениеВКоллекцию/ПоступлениеВКоллекцию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеВКоллекцию</name>
  <registerRecords>AccumulationRegister.ДвиженияМонет</registerRecords>
  <registerRecords>AccumulationRegister.ПоступлениеМонет</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Коллекционер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НакладныеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НакладныеРасходыУвеличиваютСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </attributes>
  <attributes>
    <name>РазличныеКоллекции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоллекцииСтрокой</name>
    <comment>Для отображения в списках в какие коллекции поступило</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>Монета</name>
      <type>
        <types>CatalogRef.Монеты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Издержки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коллекция</name>
      <type>
        <types>CatalogRef.Коллекции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Мюнцкабинент_30/src/AccumulationRegisters/ДвиженияМонет/ДвиженияМонет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияМонет</name>
  <comment>Приходные и расходные операции с монетами</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <comment>Фактически себестоимость единицы</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Монеты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Мюнцкабинент_30/src/Catalogs/ТипыЦен/ТипыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыЦен</name>
  <predefined>
    <items>
      <name>Оценочная</name>
      <description>Оценочная стоимость</description>
    </items>
    <items>
      <name>ЦенаПриобретения</name>
      <description>Цена приобретения (руб)</description>
    </items>
    <items>
      <name>ЦенаПродажи</name>
      <description>Цена продажи (руб)</description>
    </items>
  </predefined>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Catalog>

Мюнцкабинент_30/src/Documents/ПоступлениеВКоллекцию/Forms/ФормаДокумента/Module.bsl
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаКлиенте
Процедура ПересчитатьСуммуИздержек (Элемент)
	//
	ПересчитатьСуммуИздержекНаСервере ();
	//
	//ЭтаФорма.ТекущийЭлемент = Элемент;
	//
КонецПроцедуры	

&НаСервере
Процедура ПересчитатьСуммуИздержекНаСервере ()
	//
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;	
	
	СтрокаКоллекции = Объект.Список.НайтиПоИдентификатору(Элементы.Список.ТекущаяСтрока);
	ИндексСтрокиКоллекции = Объект.Список.Индекс(СтрокаКоллекции);
	//
	ТмпТЗ = Объект.Список.Выгрузить ();
	//
	СтрокаВыгруженнойТаблицы = ТмпТЗ.Получить(ИндексСтрокиКоллекции);
	//
	ТмпТЗ.Колонки.Добавить("СуммаБезИздержек", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Для Каждого Строка ИЗ ТмпТЗ Цикл
		Строка.СуммаБезИздержек 				= Строка.Цена * ?(Строка.Количество > 0, Строка.Количество, 1)
	КонецЦикла;	
	//
	ИтогоСуммаБезИздержек					= ТмпТЗ.Итог("СуммаБезИздержек");
	//
	Сч 											= 0; 
	СуммаРаспределенныхРасходов 				= 0;
	КоличествоСтрок 							= ТмпТЗ.Количество();
	
	Для Каждого Строка ИЗ ТмпТЗ Цикл
		Сч = Сч + 1;
		//
		Если Сч = КоличествоСтрок Тогда
			Строка.Издержки 					= Объект.НакладныеРасходы - СуммаРаспределенныхРасходов;
		Иначе	
			Строка.Издержки 					= Строка.СуммаБезИздержек / ИтогоСуммаБезИздержек * Объект.НакладныеРасходы;
			СуммаРаспределенныхРасходов 		= СуммаРаспределенныхРасходов + Строка.Издержки;
		КонецЕсли;	
		
		Строка.Сумма							= Строка.Издержки + Строка.СуммаБезИздержек;
		
	КонецЦикла;	
	//
	ИндексСтрокиПослеПересчета = ТмпТЗ.Индекс(СтрокаВыгруженнойТаблицы);
	//
	Объект.Список.Загрузить(ТмпТЗ);
	//
	СтрокаКоллекции = Объект.Список.Получить(ИндексСтрокиПослеПересчета);
	Элементы.Список.ТекущаяСтрока = СтрокаКоллекции.ПолучитьИдентификатор();
	//
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда // новый
		Объект.Дата									= ТекущаяДата();
		Объект.ТипЦены								= Справочники.ТипыЦен.ЦенаПриобретения;
		Объект.НакладныеРасходыУвеличиваютСтоимость = Истина;
	КонецЕсли;	
	
  	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура НакладныеРасходыПриИзменении(Элемент)
	//
	ПересчитатьСуммуИздержек (Элемент);
	//
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюРеквизитовКоллекция ();
	УправлениеВидимостьюКолонкиИздержки ();
	
	ОсновнаяУчетнаяВалюта = ПолучитьОсновнуюУчетнуюВалюту ();
	Если ОсновнаяУчетнаяВалюта.Пустая () Тогда
		ТекстПояснения = НСтр("ru = 'Не установлена основная учетная валюта.'"); 
		ПоказатьОповещениеПользователя(НСтр("ru = 'Установите учетные валюты!'"),
			"e1cib/app/ОбщаяФорма.ФормаВалютныхКонстант", ТекстПояснения, БиблиотекаКартинок.Предупреждение32);
	КонецЕсли;
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОсновнуюУчетнуюВалюту ()

	Возврат Константы.ОсновнаяУчетнаяВалюта.Получить()

КонецФункции // ПолучитьОсновнуюУчетнуюВалюту ()()

&НаКлиенте
Процедура СписокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Количество = 1
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РазличныеКоллекцииПриИзменении(Элемент)
	УправлениеВидимостьюРеквизитовКоллекция ()
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюРеквизитовКоллекция ()
	
	Элементы.Коллекция.Видимость 		= НЕ Объект.РазличныеКоллекции;
	Элементы.СписокКоллекция.Видимость 	= Объект.РазличныеКоллекции;
	//
	Если Объект.РазличныеКоллекции Тогда
		Объект.Коллекция				= ПредопределенноеЗначение("Справочник.Коллекции.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура УправлениеВидимостьюКолонкиИздержки ()
	
	Элементы.СписокИздержки.Видимость = Объект.НакладныеРасходыУвеличиваютСтоимость;
	
КонецПроцедуры	

&НаКлиенте
Процедура СписокЦенаПриИзменении(Элемент)
	//
	ПересчитатьСуммуИздержек (Элемент);
	//
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКомментарийНаСервере(Знач Примечание)
	Для Каждого Строка ИЗ Объект.Список Цикл
		МонетаОбъект 		= Строка.Монета.ПолучитьОбъект ();
		ПримечаниеМонеты 	= МонетаОбъект.Комментарий;
		Если Найти (ПримечаниеМонеты, Примечание) = 0 Тогда
			ПримечаниеМонеты = ?(ПустаяСтрока (ПримечаниеМонеты), Примечание, ПримечаниеМонеты + " (" + Примечание + ")");
		КонецЕсли;
		МонетаОбъект.Комментарий = ПримечаниеМонеты;
		Попытка
			МонетаОбъект.Записать ();
		Исключение
        	Продолжить
		КонецПопытки;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКомментарий(Команда)
	ЗаписатьКомментарийНаСервере(Объект.Комментарий);
КонецПроцедуры

&НаКлиенте
Процедура НакладныеРасходыУвеличиваютСтоимостьПриИзменении(Элемент)
	Если Объект.НакладныеРасходыУвеличиваютСтоимость Тогда
		
		ПересчитатьСуммуИздержек (Элемент);		
		
	Иначе
		Для Каждого Строка ИЗ Объект.Список Цикл
			Строка.Издержки = 0;
			Строка.Сумма 	= ?(Строка.Количество = 0, 1, Строка.Количество) * Строка.Цена;
		КонецЦикла;	
	КонецЕсли;	
	
	УправлениеВидимостьюКолонкиИздержки ();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКоличествоПриИзменении(Элемент)
	//
	ПересчитатьСуммуИздержек (Элемент);
	//
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Отказ = МонетыУжеЕстьНаОстатках ();
	
КонецПроцедуры

Функция МонетыУжеЕстьНаОстатках ()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ТмпТЗ = Объект.Список.Выгрузить (, "НомерСтроки,Монета");
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.НомерСтроки,
		|	ТЗ.Монета
		|ПОМЕСТИТЬ Монеты
		|ИЗ
		|	&ТпмТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Монеты.НомерСтроки,
		|	ДвиженияМонетОстаткиИОбороты.Объект КАК Монета,
		|	ДвиженияМонетОстаткиИОбороты.Коллекция,
		|	ДвиженияМонетОстаткиИОбороты.Регистратор,
		|	ДвиженияМонетОстаткиИОбороты.КоличествоКонечныйОстаток КАК Количество
		|ИЗ
		|	Монеты КАК Монеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияМонет.ОстаткиИОбороты(, , Регистратор, , ) КАК ДвиженияМонетОстаткиИОбороты
		|		ПО Монеты.Монета = ДвиженияМонетОстаткиИОбороты.Объект
		|ГДЕ
		|	ДвиженияМонетОстаткиИОбороты.Регистратор <> &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Монеты";
	
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТпмТЗ", ТмпТЗ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Cтрока %1: %2 уже в коллекции %3! Регистратор: %4'"), Выборка.НомерСтроки, Выборка.Монета, Выборка.Коллекция, Выборка.Регистратор);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Список [" + Выборка.НомерСтроки + "]" + ".Монета", "Объект");
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции	

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры
